In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Sklearn modules
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report
from sklearn.tree import DecisionTreeClassifier, plot_tree
from sklearn.preprocessing import MinMaxScaler

In [2]:
df=pd.read_csv(r"D:\Download\quikr_car.csv")
df.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [3]:
df['name']=df["name"].str.replace(',',' ').str.split(' ').str.slice(0,3).str.join(' ')

In [4]:
df.head()

                     name   company  year          Price  kms_driven fuel_type
0     Hyundai Santro Xing   Hyundai  2007         80,000  45,000 kms    Petrol
1     Mahindra Jeep CL550  Mahindra  2006       4,25,000      40 kms    Diesel
2      Maruti Suzuki Alto    Maruti  2018  Ask For Price  22,000 kms    Petrol
3       Hyundai Grand i10   Hyundai  2014       3,25,000  28,000 kms    Petrol
4  Ford EcoSport Titanium      Ford  2014       5,75,000  36,000 kms    Diesel

In [5]:
df['year'].unique()
df=df[df['year'].astype(str).str.isnumeric()]

In [6]:
df.dropna(subset=['year'])
df['year']=df['year'].astype(int)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 842 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        842 non-null    object
 1   company     842 non-null    object
 2   year        842 non-null    int64
 3   Price       842 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: int64(1), object(5)
memory usage: 46.0+ KB

In [8]:
#df['Price'].unique()
df=df[df['Price']!="Ask For Price"]

In [9]:
df['Price'].unique()

array(['80,000', '4,25,000', '3,25,000', '5,75,000', '1,75,000',
       '1,90,000', '8,30,000', '2,50,000', '1,82,000', '3,15,000',
       '4,15,000', '3,20,000', '10,00,000', '5,00,000', '3,50,000',
       '1,60,000', '3,10,000', '75,000', '1,00,000', '2,90,000', '95,000',
       '1,80,000', '3,85,000', '1,05,000', '6,50,000', '6,89,999',
       '4,48,000', '5,49,000', '5,01,000', '4,89,999', '2,80,000',
       '3,49,999', '2,84,999', '3,45,000', '4,99,999', '2,35,000',
       '2,49,999', '14,75,000', '3,95,000', '2,20,000', '1,70,000',
       '85,000', '2,00,000', '5,70,000', '1,10,000', '4,48,999',
       '18,91,111', '1,59,500', '3,44,999', '4,49,999', '8,65,000',
       '6,99,000', '3,75,000', '2,24,999', '12,00,000', '1,95,000',
       '3,51,000', '2,40,000', '90,000', '1,55,000', '6,00,000',
       '1,89,500', '2,10,000', '3,90,000', '1,35,000', '16,00,000',
       '7,01,000', '2,65,000', '5,25,000', '3,72,000', '6,35,000',
       '5,50,000', '4,85,000', '3,29,500', '2,51,111', '5,69,999',
       '69,999', '2,99,999', '3,99,999', '4,50,000', '2,70,000',
       '1,58,400', '1,79,000', '1,25,000', '2,99,000', '1,50,000',
       '2,75,000', '2,85,000', '3,40,000', '70,000', '2,89,999',
       '8,49,999', '7,49,999', '2,74,999', '9,84,999', '5,99,999',
       '2,44,999', '4,74,999', '2,45,000', '1,69,500', '3,70,000',
       '1,68,000', '1,45,000', '98,500', '2,09,000', '1,85,000',
       '9,00,000', '6,99,999', '1,99,999', '5,44,999', '1,99,000',
       '5,40,000', '49,000', '7,00,000', '55,000', '8,95,000', '3,55,000',
       '5,65,000', '3,65,000', '40,000', '4,00,000', '3,30,000',
       '5,80,000', '3,79,000', '2,19,000', '5,19,000', '7,30,000',
       '20,00,000', '21,00,000', '14,00,000', '3,11,000', '8,55,000',
       '5,35,000', '1,78,000', '3,00,000', '2,55,000', '5,49,999',
       '3,80,000', '57,000', '4,10,000', '2,25,000', '1,20,000', '59,000',
       '5,99,000', '6,75,000', '72,500', '6,10,000', '2,30,000',
       '5,20,000', '5,24,999', '4,24,999', '6,44,999', '5,84,999',
       '7,99,999', '4,44,999', '6,49,999', '9,44,999', '5,74,999',
       '3,74,999', '1,30,000', '4,01,000', '13,50,000', '1,74,999',
       '2,39,999', '99,999', '3,24,999', '10,74,999', '11,30,000',
       '1,49,000', '7,70,000', '30,000', '3,35,000', '3,99,000', '65,000',
       '1,69,999', '1,65,000', '5,60,000', '9,50,000', '7,15,000',
       '45,000', '9,40,000', '1,55,555', '15,00,000', '4,95,000',
       '8,00,000', '12,99,000', '5,30,000', '14,99,000', '32,000',
       '4,05,000', '7,60,000', '7,50,000', '4,19,000', '1,40,000',
       '15,40,000', '1,23,000', '4,98,000', '4,80,000', '4,88,000',
       '15,25,000', '5,48,900', '7,25,000', '99,000', '52,000',
       '28,00,000', '4,99,000', '3,81,000', '2,78,000', '6,90,000',
       '2,60,000', '90,001', '1,15,000', '15,99,000', '1,59,000',
       '51,999', '2,15,000', '35,000', '11,50,000', '2,69,000', '60,000',
       '4,30,000', '85,00,003', '4,01,919', '4,90,000', '4,24,000',
       '2,05,000', '5,49,900', '4,35,000', '1,89,700', '3,89,700',
       '3,60,000', '2,95,000', '1,14,990', '10,65,000', '4,70,000',
       '48,000', '1,88,000', '4,65,000', '1,79,999', '21,90,000',
       '23,90,000', '10,75,000', '4,75,000', '10,25,000', '6,15,000',
       '19,00,000', '14,90,000', '15,10,000', '18,50,000', '7,90,000',
       '17,25,000', '12,25,000', '68,000', '9,70,000', '31,00,000',
       '8,99,000', '88,000', '53,000', '5,68,500', '71,000', '5,90,000',
       '7,95,000', '42,000', '1,89,000', '1,62,000', '35,999',
       '29,00,000', '39,999', '50,500', '5,10,000', '8,60,000',
       '5,00,001'], dtype=object)

In [10]:
df['Price']=df['Price'].str.replace(',','')

In [11]:
df['Price'].unique()

array(['80000', '425000', '325000', '575000', '175000', '190000',
       '830000', '250000', '182000', '315000', '415000', '320000',
       '1000000', '500000', '350000', '160000', '310000', '75000',
       '100000', '290000', '95000', '180000', '385000', '105000',
       '650000', '689999', '448000', '549000', '501000', '489999',
       '280000', '349999', '284999', '345000', '499999', '235000',
       '249999', '1475000', '395000', '220000', '170000', '85000',
       '200000', '570000', '110000', '448999', '1891111', '159500',
       '344999', '449999', '865000', '699000', '375000', '224999',
       '1200000', '195000', '351000', '240000', '90000', '155000',
       '600000', '189500', '210000', '390000', '135000', '1600000',
       '701000', '265000', '525000', '372000', '635000', '550000',
       '485000', '329500', '251111', '569999', '69999', '299999',
       '399999', '450000', '270000', '158400', '179000', '125000',
       '299000', '150000', '275000', '285000', '340000', '70000',
       '289999', '849999', '749999', '274999', '984999', '599999',
       '244999', '474999', '245000', '169500', '370000', '168000',
       '145000', '98500', '209000', '185000', '900000', '699999',
       '199999', '544999', '199000', '540000', '49000', '700000', '55000',
       '895000', '355000', '565000', '365000', '40000', '400000',
       '330000', '580000', '379000', '219000', '519000', '730000',
       '2000000', '2100000', '1400000', '311000', '855000', '535000',
       '178000', '300000', '255000', '549999', '380000', '57000',
       '410000', '225000', '120000', '59000', '599000', '675000', '72500',
       '610000', '230000', '520000', '524999', '424999', '644999',
       '584999', '799999', '444999', '649999', '944999', '574999',
       '374999', '130000', '401000', '1350000', '174999', '239999',
       '99999', '324999', '1074999', '1130000', '149000', '770000',
       '30000', '335000', '399000', '65000', '169999', '165000', '560000',
       '950000', '715000', '45000', '940000', '155555', '1500000',
       '495000', '800000', '1299000', '530000', '1499000', '32000',
       '405000', '760000', '750000', '419000', '140000', '1540000',
       '123000', '498000', '480000', '488000', '1525000', '548900',
       '725000', '99000', '52000', '2800000', '499000', '381000',
       '278000', '690000', '260000', '90001', '115000', '1599000',
       '159000', '51999', '215000', '35000', '1150000', '269000', '60000',
       '430000', '8500003', '401919', '490000', '424000', '205000',
       '549900', '435000', '189700', '389700', '360000', '295000',
       '114990', '1065000', '470000', '48000', '188000', '465000',
       '179999', '2190000', '2390000', '1075000', '475000', '1025000',
       '615000', '1900000', '1490000', '1510000', '1850000', '790000',
       '1725000', '1225000', '68000', '970000', '3100000', '899000',
       '88000', '53000', '568500', '71000', '590000', '795000', '42000',
       '189000', '162000', '35999', '2900000', '39999', '50500', '510000',
       '860000', '500001'], dtype=object)

In [12]:
df['Price']=df['Price'].astype('int')

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 819 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        819 non-null    object
 1   company     819 non-null    object
 2   year        819 non-null    int64
 3   Price       819 non-null    int64
 4   kms_driven  819 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int64(2), object(4)
memory usage: 44.8+ KB

In [14]:
#df['kms_driven'].unique()
df['kms_driven'].str.replace(',','')

0       45000 kms
1          40 kms
3       28000 kms
4       36000 kms
6       41000 kms
          ...
886    132000 kms
888     27000 kms
889     40000 kms
890        Petrol
891        Petrol
Name: kms_driven, Length: 819, dtype: object

In [15]:
df['kms_driven']=df['kms_driven'].str.split(' ').str.get(0)

In [16]:
df['kms_driven'].unique()

array(['45,000', '40', '28,000', '36,000', '41,000', '25,000', '24,530',
       '60,000', '30,000', '32,000', '48,660', '4,000', '16,934',
       '43,000', '35,550', '39,522', '39,000', '55,000', '72,000',
       '15,975', '70,000', '23,452', '35,522', '48,508', '15,487',
       '82,000', '20,000', '68,000', '38,000', '27,000', '33,000',
       '46,000', '16,000', '47,000', '35,000', '30,874', '15,000',
       '29,685', '1,30,000', '19,000', '54,000', '13,000', '38,200',
       '22,000', '50,000', '13,500', '3,600', '45,863', '60,500',
       '12,500', '18,000', '13,349', '29,000', '44,000', '42,000',
       '14,000', '49,000', '36,200', '51,000', '1,04,000', '33,333',
       '33,600', '5,600', '7,500', '26,000', '24,330', '65,480',
       '2,00,000', '59,000', '99,000', '2,800', '21,000', '11,000',
       '66,000', '3,000', '7,000', '38,500', '37,200', '43,200', '24,800',
       '45,872', '40,000', '11,400', '97,200', '52,000', '31,000',
       '1,75,430', '37,000', '65,000', '3,350', '75,000', '62,000',
       '73,000', '2,200', '54,870', '34,580', '97,000', '60', '80,200',
       '3,200', '0,000', '5,000', '588', '71,200', '1,75,400', '9,300',
       '56,758', '10,000', '56,450', '56,000', '32,700', '9,000', '73',
       '1,60,000', '58,559', '57,000', '1,70,000', '80,000', '6,821',
       '23,000', '34,000', '1,800', '4,00,000', '48,000', '90,000',
       '12,000', '69,900', '1,66,000', '122', '0', '36,469', '7,800',
       '24,695', '15,141', '59,910', '1,00,000', '4,500', '1,29,000',
       '300', '1,31,000', '1,11,111', '59,466', '25,500', '44,005',
       '2,110', '43,222', '1,00,200', '65', '1,40,000', '1,03,553',
       '58,000', '1,20,000', '49,800', '100', '81,876', '6,020', '55,700',
       '18,500', '53,000', '35,500', '22,134', '1,000', '8,500', '87,000',
       '6,000', '8,000', '55,800', '56,400', '72,160', '11,500',
       '1,33,000', '2,000', '88,000', '65,422', '1,17,000', '1,50,000',
       '10,750', '6,800', '9,800', '57,923', '30,201', '6,200', '37,518',
       '24,652', '383', '95,000', '3,528', '52,500', '47,900', '52,800',
       '1,95,000', '48,008', '48,247', '9,400', '64,000', '2,137',
       '10,544', '1,47,000', '90,001', '48,006', '74,000', '85,000',
       '29,500', '39,700', '67,000', '19,336', '60,105', '45,933',
       '1,02,563', '28,600', '41,800', '1,16,000', '42,590', '7,400',
       '54,500', '76,000', '00', '11,523', '38,600', '95,500', '37,458',
       '85,960', '12,516', '30,600', '2,550', '62,500', '69,000',
       '28,400', '68,485', '3,500', '85,455', '63,000', '1,600', '77,000',
       '26,500', '2,875', '13,900', '1,500', '2,450', '1,625', '33,400',
       '60,123', '1,37,495', '91,200', '1,46,000', '1,00,800', '2,100',
       '2,500', '1,32,000', 'Petrol'], dtype=object)

In [17]:
df=df[df['kms_driven']!="Petrol"]

In [18]:
df['kms_driven']=df['kms_driven'].str.replace(',','')

In [19]:
df['kms_driven']=df['kms_driven'].astype(int).values

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int64
 3   Price       817 non-null    int64
 4   kms_driven  817 non-null    int64
 5   fuel_type   816 non-null    object
dtypes: int64(3), object(3)
memory usage: 44.7+ KB

In [21]:
df['fuel_type'].unique()

array(['Petrol', 'Diesel', nan, 'LPG'], dtype=object)

In [22]:
df=df[~df['fuel_type'].isna()]

In [23]:
df['fuel_type'].value_counts()

fuel_type
Petrol    428
Diesel    386
LPG         2
Name: count, dtype: int64

In [24]:
df=df.reset_index(drop=True)

In [25]:
df.head()

                     name   company  year   Price  kms_driven fuel_type
0     Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1     Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2       Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3  Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4               Ford Figo      Ford  2012  175000       41000    Diesel

In [26]:
df.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [27]:
df=df[df["Price"]<6e6].reset_index(drop=True)

In [28]:
df.describe()

              year         Price     kms_driven
count   815.000000  8.150000e+02     815.000000
mean   2012.442945  4.017933e+05   46277.096933
std       4.005079  3.815888e+05   34318.459638
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.900000e+05   56879.000000
max    2019.000000  3.100000e+06  400000.000000

In [29]:
df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
811          Tata Indica V2      Tata  2009  110000       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
813            Tata Zest XM      Tata  2018  260000       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[815 rows x 6 columns]

In [30]:
x=df.drop('Price',axis=1)

In [31]:
x

                       name   company  year  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006          40    Diesel
2         Hyundai Grand i10   Hyundai  2014       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014       36000    Diesel
4                 Ford Figo      Ford  2012       41000    Diesel
..                      ...       ...   ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011       50000    Petrol
811          Tata Indica V2      Tata  2009       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009      132000    Petrol
813            Tata Zest XM      Tata  2018       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013       40000    Diesel

[815 rows x 5 columns]

In [32]:
y=df.iloc[:,3]

In [33]:
y

0       80000
1      425000
2      325000
3      575000
4      175000
        ...
810    270000
811    110000
812    300000
813    260000
814    390000
Name: Price, Length: 815, dtype: int64

In [34]:
x.columns

Index(['name', 'company', 'year', 'kms_driven', 'fuel_type'], dtype='object')

In [35]:
from sklearn.preprocessing import OneHotEncoder

In [37]:
encode=OneHotEncoder()
x_encode=encode.fit_transform(x)

In [39]:
x_encode.toarray()

array([[0., 0., 0., ..., 0., 0., 1.],
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 0., 0., 1.],
       ...,
       [0., 0., 0., ..., 0., 0., 1.],
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 1., 0., 0.]])

In [40]:
from sklearn.model_selection import train_test_split

In [49]:
x_train, x_test, y_train, y_test=train_test_split(x_encode,y,test_size=0.2,random_state=0)

In [52]:
len(x_train.toarray())

652

In [53]:
len(x_test.toarray())

163

In [54]:
from sklearn.linear_model import LinearRegression

In [55]:
lr=LinearRegression()

In [61]:
lr.fit(x_train,y_train)
y_pred = lr.predict(x_test)

In [66]:
data=pd.DataFrame({"actual":y_test.values,"predicted":y_pred})
data

      actual     predicted
0     270000  2.631722e+05
1     375000  4.043212e+05
2     220000  4.097732e+05
3      99999  1.633437e+05
4     180000  1.799992e+05
..       ...           ...
158   235000  2.350009e+05
159   385000  3.850015e+05
160   195000  2.900245e+05
161  1891111  1.891110e+06
162   372000  3.720005e+05

[163 rows x 2 columns]

In [68]:
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

# Calculate metrics
mae = mean_absolute_error(y_test, y_pred)
mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)

# Display results
print(f"Mean Absolute Error (MAE): {mae}")
print(f"Mean Squared Error (MSE): {mse}")
print(f"R² Score: {r2}")

Mean Absolute Error (MAE): 107460.69118778544
Mean Squared Error (MSE): 34940698548.16046
R² Score: 0.7142681112157847